Repository: palomarl/74531705
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: Lingerie comes in all sorts of colors and styles, but it also comes in just as many materials, fabrics and finishes.
es_es: La lencería está disponible en todo tipo de colores y estilos, pero también en muchos materiales, tejidos y acabados.

source: Look for a soap that’s body-safe so it won’t irritate your sensitive bits.
es_es: Busca un jabón que sea seguro para el cuerpo para que no irrite tus partes sensibles.

source: Lycra is always blended with other fibers and therefore washing should be based on what the primary fiber is.
es_es: La lycra siempre se mezcla con otras fibras y, por lo tanto, debería lavarse dependiendo de cuál sea la fibra principal.

source: Made from body-friendly silicone with some ABS plastic
es_es: Fabricado con silicona respetuosa con el cuerpo y algo de plástico ABS

source: Made from firm & durable ABS plastic
es_es: Fabricado en plástico ABS resistente y duradero

source: Made primarily from smooth, body-safe silicone with some ABS plastic
es_es: - Fabricado principalmente con silicona suave y segura para el cuerpo, con algo de plástico ABS

source: Make sure the balls are fully charged or have fresh batteries for peak performance.
es_es: Asegúrate de que las bolas están completamente cargadas o tienen pilas nuevas para obtener el máximo rendimiento.

source: Make sure you have your own Sweet Teddy Doll ready for that special evening, get-away, or vacation!
es_es: Asegúrate de tener tu propia Sweet Teddy Doll lista para esa noche especial, escapada o vacaciones.

source: Make sure your Kegel Balls are made from a firm material like glass, metal, or dense silicone.
es_es: Asegúrate de que tus bolas de Kegel estén fabricadas con un material firme, como cristal, metal o silicona densa.

source: Makes a fantastic gift.
es_es: Un regalo fantástico.

source: Male masturbation can help prevent prostate cancer, while female masturbation can alleviate some menstrual pain by helping with cramps.
es_es: La masturbación masculina puede ayudar a prevenir el cáncer de próstata, mientras que la femenina puede aliviar algunos dolores menstruales al ayudar con los calambres.

source: Male masturbation commonly involves penis stroking, but it can also include playing with balls or even teasing a sensitive erogenous zone such as the prostate.
es_es: La masturbación masculina suele consistir en acariciar el pene, pero también puede incluir jugar con los testículos o incluso estimular una zona erógena sensible, como es la próstata.

source: Male masturbation is pretty straightforward.
es_es: La masturbación masculina es bastante sencilla.

source: Many couples use them during foreplay.
es_es: Muchas parejas los utilizan durante los preliminares.

source: Many couples use vibrators during foreplay to help set the mood the easier.
es_es: Muchas parejas utilizan vibradores durante los preliminares para ayudar a crear el ambiente más fácilmente.

source: Many realistic toys, however, are made from special materials that mimic the look and feel of real skin as closely as possible.
es_es: Sin embargo, muchos juguetes realistas están fabricados con materiales especiales que imitan al máximo el aspecto y el tacto de la piel real.

source: Many vibrators are designed specifically to target a woman’s most sensitive erogenous zones – namely her clit, vagina or G-Spot – for maximum stimulation.
es_es: Muchos vibradores están diseñados específicamente para llegar a las zonas erógenas más sensibles de la mujer, como el clítoris, la vagina o el punto G, y estimularlas al máximo.

source: Many women actually experience their first orgasm with a vibrator instead of a sexual partner.
es_es: De hecho, muchas mujeres no experimentan su primer orgasmo con su pareja, sino usando un vibrador.

source: Many women use rabbit vibrators as an instructional tool in orgasms before they become comfortable enough to climax with their partner.
es_es: Muchas mujeres utilizan los vibradores con forma de conejo como herramienta de instrucción en los orgasmos antes de sentirse lo suficientemente cómodas para llegar al clímax con su pareja.

source: Many women use them for performing Kegel exercises, which is why they're also known as Kegel Balls.
es_es: Muchas mujeres las usan para realizar ejercicios de Kegel y por eso también se llaman Bolas de Kegel.

source: Masturbation can be something you do by yourself with the door shut or it could be something you do in front of your partner as part of foreplay.
es_es: La masturbación puede ser algo que haces a solas con la puerta cerrada o algo que haces delante de tu pareja como parte de los preliminares.

source: Masturbation does not cause cancer.
es_es: La masturbación no provoca cáncer.

source: Masturbation enhances your self-esteem by helping you become more in tune with your body and improving your body image.
es_es: La masturbación aumenta la autoestima, ya que te ayuda a estar más en sintonía con tu cuerpo y a mejorar tu imagen corporal.

source: Masturbation improves your health and well-being.
es_es: La masturbación mejora la salud y el bienestar.

source: Masturbation is a perfectly normal activity.
es_es: La masturbación es una actividad perfectamente normal.

source: Masturbation is even good for your sex life since it teaches you about your body and what you like during sex.
es_es: La masturbación es incluso buena para tu vida sexual, ya que te enseña sobre tu cuerpo y lo que te gusta durante el sexo.

source: Masturbation is perfectly healthy.
es_es: La masturbación es perfectamente sana.

source: Masturbation makes it easier for both men and women to fall asleep and lead to a more restful night.
es_es: La masturbación facilita que tanto hombres como mujeres concilien el sueño y tengan una noche más reparadora.

source: Masturbation might not be something you talk about around the family dinner table, but it’s still a perfectly healthy part of life.
es_es: Puede que la masturbación no sea algo de lo que se hable en la mesa familiar durante la cena, pero sigue siendo una parte perfectamente sana de la vida.

source: Masturbation relieves stress by flooding your body with mood-enhancing endorphins for a natural high.
es_es: La masturbación alivia el estrés inundando el cuerpo de endorfinas que mejoran el estado de ánimo y producen un subidón natural.

source: Meanwhile, you can start thrusting your finger in and out of your vagina.
es_es: Mientras tanto, puedes empezar a meter y sacar el dedo de la vagina.

source: Measures 3.6 inches high by 2.7 inches wide
es_es: Mide 3,6 pulgadas de alto por 2,7 pulgadas de ancho

source: Meet the Writer
es_es: Conoce a la autora

source: Men and women have been masturbating before they learned how to make fire.
es_es: La masturbación se ha practicado por parte de hombres y mujeres mucho antes de que aprendieran a hacer fuego.

source: Men and women masturbate mostly because it just feels good, and orgasms feel even better.
es_es: Los hombres y las mujeres se masturban sobre todo porque se sienten bien, y los orgasmos son aún mejores.

source: Monogamy A Hot Affair With Your Partner Game
es_es: Monogamia Un Juego Caliente Con Tu Pareja

source: Monogamy A Hot Affair With Your Partner Game - Sex Games and Books | Adam & Eve
es_es: Juego: Monogamia Una aventura caliente con tu pareja - Juegos sexuales y libros | Adam & Eve

source: Monogamy squares direct you to pick a card.
es_es: Las casillas de Monogamia te indican que elijas una carta.

source: Most cleaners require you to simply spray your sex toy, wipe it clean with a damp cloth, and then dry it off with a lint-free cloth.
es_es: En la mayoría de los limpiadores basta con rociar el juguete sexual, limpiarlo con un paño húmedo y secarlo con un paño que no suelte pelusa.

source: Next, we strongly recommend buying Ben Wa Balls that come with a retrieval cord or finger ring, so you can remove them easily.
es_es: A continuación, recomendamos encarecidamente comprar Bolas Ben Wa que vengan con un cordón de recuperación o una anilla para el dedo, para poder extraerlas fácilmente.

source: Non-porous toys collect lint and hair even if they’re just lying around in your nightstand, so you need to use lint-free cloths or towels and keep them in a special storage bag.
es_es: Los juguetes no porosos acumulan pelusas y pelos aunque estén en la mesilla de noche, por lo que debes utilizar paños o toallas que no suelten pelusas y guardarlos en una bolsa especial.

source: Non-vibrating glass toys can be dipped in boiling water or run through the dishwasher.
es_es: Los juguetes de vidrio que no vibran pueden sumergirse en agua hirviendo o pasarse por el lavavajillas.

source: Non-vibrating metal toys can be dipped in boiling water or run through the dishwasher.
es_es: Los juguetes metálicos que no vibran pueden sumergirse en agua hirviendo o pasarse por el lavavajillas.

source: Non-vibrating silicone toys can be dipped in boiling water or run through the dishwasher.
es_es: Los juguetes de silicona sin vibración pueden sumergirse en agua hirviendo o pasarse por el lavavajillas.

source: Not knowing when they’ll turn it on or off can be incredibly arousing.
es_es: No saber cuándo lo van a encender o apagar puede ser increíblemente excitante.

source: Nylon is a synthetic material also.
es_es: El nailon también es un material sintético.

source: Odds are that everyone you meet during the day masturbates.
es_es: Lo más probable es que todas las personas con las que te encuentres a lo largo del día se masturben.

source: On average, it’s about 60-90 calories per session.
es_es: De media, son unas 60-90 calorías por sesión.

source: On the other hand, you can use standard dish detergent to clean sex toys made from firm materials like plastic.
es_es: Por otro lado, puedes utilizar detergente para vajilla normal para limpiar juguetes sexuales fabricados con materiales firmes como el plástico.

source: On top of my work with Adam & Eve, I've been featured on many other prominent websites and publications including Oprah Magazine, Glamour, Cosmopolitan (multiple times), Women’s Health, Men’s Health, Shape Magazine, Playboy, Reader's Digest, HuffPost, PopSugar, and BuzzFeed.
es_es: Además de mi trabajo con Adam & Eve, he aparecido en muchos otros sitios web y publicaciones destacadas como Oprah Magazine, Glamour, Cosmopolitan (varias veces), Women's Health, Men's Health, Shape Magazine, Playboy, Reader's Digest, HuffPost, PopSugar y BuzzFeed.

source: Once it’s inserted, use your inner muscles to give it a gentle squeeze.
es_es: Una vez introducida, aprieta suavemente con los músculos internos.

source: Once you get somewhere private, you can pop the egg out and use the edge on your clit to spice things up even more.
es_es: Cuando llegues a un lugar privado, puedes sacar el huevo y utilizar el borde en el clítoris para darle aún más sabor a la cosa.

source: Once you're aroused (typically by looking at something visually stimulating), apply a generous amount of lube to your penis and hands until they're slippery.
es_es: Una vez que te hayas excitado (normalmente por mirar algo visualmente estimulante), aplica una cantidad generosa de lubricante en el pene y en las manos hasta que estén resbaladizas.

source: Once your anal toy is freshly cleaned, it’s safe to use.
es_es: Una vez que tu juguete anal esté limpio, podrás utilizarlo.

source: One of the best pieces of masturbation advice I can give you is if it feels good then keep doing it.
es_es: Uno de los mejores consejos sobre masturbación que puedo darte es que si te sientes bien, sigas haciéndolo.

source: Only buy stand-alone balls if you've got extensive experience with using them and you're not worried about removing them.
es_es: Compra bolas independientes solo si tienes mucha experiencia con ellas y no te preocupa quitarlas.

source: Optimal Cleaning Methods Based on Sex Toy Materials
es_es: Métodos de limpieza óptimos en función de los materiales de los juguetes sexuales

source: Or it could be a combo of all those actions plus more!
es_es: ¡O puede ser una combinación de todas esas acciones y más!

source: Or save it for a late-night soak in the tub and some of the sweetest dreams you’ve ever had!
es_es: O guárdalo para un baño nocturno en la bañera y tener uno de los sueños más dulces que jamás hayas tenido.

source: Or you can pack it away until your next playdate.
es_es: También puedes guardarlo hasta la próxima cita.

source: Order now for discreet shipping.
es_es: Haz tu pedido ahora para un envío discreto.

source: Other items can only be discounted by a certain percentage.
es_es: Otros artículos sólo pueden ser rebajados en un determinado porcentaje.

source: Other sex toys might have batteries and motors that can be damaged if they become wet.
es_es: Otros juguetes sexuales pueden tener pilas y motores que se estropean si se mojan.

source: Other women like to focus entirely on clit stimulation.
es_es: Otras prefieren centrarse por completo en la estimulación del clítoris.

source: Otherwise, they can quickly become a breeding ground for all kinds of nastiness and even endanger your health.
es_es: De lo contrario, pueden convertirse rápidamente en un caldo de cultivo para todo tipo de asquerosidades e incluso poner en peligro tu salud.

source: Over 10,000 Sold!
es_es: Más de 10.000 unidades vendidas

source: Over 55,000 Sold!
es_es: Más de 55.000 unidades vendidas

source: Over 725,000 Sold!
es_es: Más de 725.000 unidades vendidas

source: Overall bullet vibe measures 2.5 inches long by 0.65 inches wide
es_es: Las medidas totales del ibrador son 6,5 centímetros de largo por 1,5 centímetros de ancho.

source: Packed with 3 powerful speeds, the vibe’s suitable for everything from foreplay all the way through the Big O. The suction and vibration are controlled separately, so you can mix and match different settings for an absolutely O-mazing experience.
es_es: Equipado con 3 potentes velocidades, el vibrador es adecuado para todo, desde los preliminares hasta el orgasmo. La succión y la vibración se controlan por separado, por lo que puedes combinar diferentes ajustes para una experiencia absolutamente increíble.

source: Plastic
es_es: Plástico

source: Play with 10 thrilling vibration modes, including multiple speeds and patterns
es_es: - Juega con 10 emocionantes modos de vibración, que incluyen múltiples velocidades y patrones

source: Play with 9 fun-filled vibration modes, including speeds & patterns
es_es: Disfruta de 9 modos de vibración llenos de diversión, incluyendo distinats velocidades y ritmos

source: Please note that results may vary depending on the user’s physical condition, body chemistry and other factors.
es_es: Tenga en cuenta que los resultados pueden variar en función de la condición física, la química corporal y otros factores del usuario.

source: Press the button in the base to turn the bullet on and change settings.
es_es: Pulsa el botón que se encuentra en la base para encender la bala y cambiar los ajustes.

source: Press the button in the middle to cycle through all the different vibration modes.
es_es: Pulsa el botón central para pasar por los distintos modos de vibración.

source: Press the power button on the remote for about 3 seconds to turn the vibrator on.
es_es: Pulsa el botón de encendido del mando a distancia durante unos 3 segundos para encender el vibrador.

source: Product Description
es_es: Descripción del producto

source: Protected by Adam & Eve’s Satisfaction Guaranteed Policy
es_es: Protegido por la Política de Satisfacción Garantizada de Adam & Eve

source: Provides direct, targeted stimulation for more powerful O’s
es_es: Proporciona una estimulación directa para que tengas orgasmos más potentes

source: Push both balls and cord as deep as you're comfortable with doing while leaving the retrieval string or finger loop sticking out.
es_es: Empuja las bolas y el cordón tan profundo como te resulte cómodo, dejando que sobresalga el cordón de recuperación o el lazo para el dedo.

source: Quantity
es_es: Cantidad

source: Quantity:
es_es: Cantidad:

source: Quick press the power button to cycle through the different suction modes.
es_es: Pulsa rápidamente el botón de encendido para pasar por los distintos modos de succión.

source: Ready for more?
es_es: ¿Listo para más?

source: Realistic
es_es: Realista

source: Recharge it for up to 2 hours using the included USB cord that attaches magnetically to the metal contacts in the base.
es_es: Recárgalo durante un máximo de 2 horas utilizando el cable USB incluido que se conecta magnéticamente a los contactos metálicos de la base.

source: Recharge with the included magnetic base with USB charging cable.
es_es: Recárgalo con la base magnética incluida con cable de carga USB.

source: Rechargeable 10X Vibrating Egg might be small, but it packs a powerful punch of pure pleasure!
es_es: Rechargeable 10X Vibrating Egg puede ser pequeño, ¡pero tiene un potente golpe de puro placer!

source: Rechargeable Bullet Keeps Buzzing So You Keep O’ing!
es_es: Este vibrador bala sigue vibrando vibra para que tu sigas teniendo orgasmos!

source: Rechargeable bullet can run up to 60 minutes, charging cord included
es_es: La bala recargable puede durar hasta 60 minutos, cargador incluido

source: Rechargeable vibe runs up to 60 minutes, magnetic USB charger included
es_es: Vibrador recargable que funciona hasta 60 minutos, cargador USB magnético incluido

source: Rechargeable, includes magnetic USB docking base
es_es: - Recargable, incluye base de conexión USB magnética

source: Release and let your muscles relax for 5 seconds.
es_es: Suelta y deja que los músculos se relajen durante 5 segundos.

source: Remote uses 2 AAA batteries (sold separately)
es_es: - El mando a distancia utiliza 2 pilas AAA (se venden por separado)

source: Remove the balls slowly and carefully using the attached retrieval cord or finger loop.
es_es: Retire las bolas despacio y con cuidado utilizando el cordón de recuperación o el lazo para el dedo.

source: Remove the egg quickly with its sturdy pull cord
es_es: - Retira el huevo rápidamente con su resistente cordón de tracción

source: Remove the top of the apple-shaped case to access the vibrating stimulator.
es_es: Retira la parte superior del estuche en forma de manzana para acceder al estimulador vibrador.

source: Replace the apple-shaped top before storing it until next time.
es_es: Vuelve a colocar la tapa en forma de manzana antes de guardarlo hasta la próxima vez.

source: Reviews
es_es: Reseñas

source: Rinse it off and dry the stimulator thoroughly with a clean towel.
es_es: Acláralo y seca bien el estimulador con una toalla limpia.

source: Rule #1 Always Assume Your Anal Toy Is Dirty (Even When It’s Not)
es_es: Regla #1 Siempre asume que tu juguete anal está sucio (incluso cuando no lo está)

source: Rule #2 Scrub Your Anal Toy & Scrub It Some More
es_es: Regla #2 Limpia tu juguete anal y límpialo un poco más

source: Rule #3 Don’t Leave A Dirty Anal Toy Sitting Around
es_es: Regla #3 No dejes un juguete anal sucio por ahí

source: Runs up to 90 minutes per charge, recharges in 75 minutes
es_es: - Funciona hasta 90 minutos por carga, se recarga en 75 minutos

source: Second, the Forbidden Apple Clitoral Stimulator rocks your body with thrilling vibrations.
es_es: En segundo lugar, el estimulador de clítoris Forbidden Apple sacude tu cuerpo con emocionantes vibraciones.

source: See all Sex Toys
es_es: Ver todos los juguetes sexuales

source: Set of two vaginal kegel trainers
es_es: Set de dos ejercitadores vaginales de kegel

source: Sex Toy Materials
es_es: Materiales para juguetes sexuales

source: Sex toy cleaners contain special antibacterial agents as well as deodorizers and other features to keep your anal toy looking its best.
es_es: Los limpiadores de juguetes sexuales contienen agentes antibacterianos especiales, como desodorantes y otras características para mantener tu juguete anal con el mejor aspecto.

source: Shake any excess moisture out of the toy and allow to dry.
es_es: Sacude el juguete para eliminar el exceso de humedad y déjalo secar.

source: Sheer mesh & lace teddy
es_es: Picardías de tela transparente y encaje

source: Silicone
es_es: Silicona

source: Simply holding the balls in place during the day can offer low-key stimulation - especially if your Ben Wa Balls have a free-moving weight inside them.
es_es: Simplemente aguantar las bolas en el sitio durante el día puede ofrecer algo de estimulación, especialmente si tus Bolas Ben Wa tienen pesos libres dentro de ellas.

source: Simply holding the weighty balls in place can give your muscles quite the workout, especially if you're jogging or doing other physical activities.
es_es: Simplemente aguantar las bolas con peso en el sitio puede darle a tus músculos un buen entrenamiento, especialmente mientras correas o haces otras actividades físicas.

source: Simply insert the balls before heading out on a date.
es_es: Simplemente inserta las bolas antes de salir a una cita.

source: Simply pull them out slowly and steadily.
es_es: Basta con tirar de ellas despacio y con firmeza.

source: Since its rounded base fits right in your hand and it’s a discreet size, it’s excellent for taking with you on a romantic weekend getaway.
es_es: Como su base redondeada cabe perfectamente en la mano y tiene un tamaño discreto, es excelente para llevártelo de escapada romántica de fin de semana.

source: Since the egg vibe is made from silicone, you should only use water-based lubes.
es_es: Como el huevo vibrador está hecho de silicona, sólo debes utilizar lubricantes a base de agua.

source: Since the stimulator’s fully waterproof, you can use it almost anywhere.
es_es: Como el estimulador es totalmente impermeable, puedes usarlo casi en cualquier sitio.

source: Single ball trainer: 3.78” long, 1.3” wide, weighs 1.66 oz.
es_es: Entrenador de una sola bola: 3,78" de largo, 1,3" de ancho, pesa 1,66 oz.

source: Size Chart
es_es: Tabla de tallas

source: Small and heavy balls are harder to hold, which is why they're intended for more advanced users.
es_es: Los balones pequeños y pesados son más difíciles de sujetar, por eso están pensados para usuarios más avanzados.

source: Smooth opening feels even better with lube
es_es: - Su suave abertura se siente aún mejor con lubricante

source: Snap closure cotton lined crotch
es_es: Entrepierna forrada de algodón con cierre a presión

source: Some couples’ vibrators are designed to be used during sex for mutual pleasure.
es_es: Los vibradores de algunas parejas están diseñados para ser utilizados durante las relaciones sexuales y ofrecen placer mutuo.

source: Some items cannot be discounted at all.
es_es: Algunos artículos no admiten ningún descuento.

source: Some like to grind and rub on something like a soft pillow or even their hand.
es_es: A algunas les gusta machacarse y frotarse con algo como una almohada blanda o incluso con la mano.

source: Some prefer to use sex toys, like rabbit and G-Spot vibrators.
es_es: Algunas prefieren utilizar juguetes sexuales, como vibradores de conejo y de punto G.

source: Some sex toys have textured surfaces filled with hard-to-reach nooks and crannies.
es_es: Algunos juguetes sexuales tienen superficies texturizadas llenas de recovecos difíciles de alcanzar.

source: Some toy experts recommend slipping a condom around your anal toy before using it.
es_es: Algunos expertos en juguetes recomiendan colocar un preservativo alrededor del juguete anal antes de utilizarlo.

source: Some vibes are designed specifically for couples to use while having sex.
es_es: Algunos vibradores están diseñados específicamente para que las parejas los utilicen mientras practican sexo.
